var data = [
    // 圆心
    {
        'id': '0.0',
        'parent': '',
        'name': '旅游业',
        'value': 20654.39
    }, 

// -------------------------------------------------------

    // 第二圈 各个洲的数据
    {
        'id': '1.1',
        'parent': '0.0',
        'name': '亚洲', // Asia
        'value': 11909.96
    }, {
        'id': '1.2',
        'parent': '0.0',
        'name': '欧洲',
        'value': 4140.39
    }, {
        'id': '1.3',
        'parent': '0.0',
        'name': '美洲',
        'value': 2717.38
    },{
        'id': '1.4',
        'parent': '0.0',
        'name': '大洋洲',
        'value': 1429.05
    },{
        'id': '1.5',
        'parent': '0.0',
        'name': '非洲',
        'value': 457.61
    }, 

// ------------------------------------------------------

    // 第三圈 亚洲包含的国家
    {
        'id': '2.10',
        'parent': '1.1',
        'name': '韩国', 
        'value': 3686
    },  {
        'id': '2.11',
        'parent': '1.1',
        'name': '日本',
        'value': 2835.49
    }, {
        'id': '2.12',
        'parent': '1.1',
        'name': '马来西亚', 
        'value': 1040.28
    },  {
        'id': '2.13',
        'parent': '1.1',
        'name': '蒙古', 
        'value': 880.92
    },{
        'id': '2.14',
        'parent': '1.1',
        'name': '新加坡', 
        'value': 826.8
    },{
        'id': '2.15',
        'parent': '1.1',
        'name': '菲律宾', 
        'value': 833.28
    },{
        'id': '2.16',
        'parent': '1.1',
        'name': '泰国', 
        'value': 564.67
    }, {
        'id': '2.17',
        'parent': '1.1',
        'name': '印度',
        'value': 556.9
    }, {
        'id': '2.18',
        'parent': '1.1',
        'name': '印度尼西亚',
        'value': 505.02
    }, {
        'id': '2.19',
        'parent': '1.1',
        'name': '朝鲜', 
        'value': 144.6
    },
    // 第三圈 欧洲包含的国家
    {
        'id': '2.20',
        'parent': '1.2',
        'name': '俄罗斯', 
        'value': 1999.04
    },{
        'id': '2.21',
        'parent': '1.2',
        'name': '德国', 
        'value': 551.2
    },{
        'id': '2.22',
        'parent': '1.2',
        'name': '英国', 
        'value': 527.4
    },{
        'id': '2.23',
        'parent': '1.2',
        'name': '法国', 
        'value': 442.73
    },{
        'id': '2.24',
        'parent': '1.2',
        'name': '意大利', 
        'value': 211.91
    },{
        'id': '2.25',
        'parent': '1.2',
        'name': '荷兰', 
        'value': 168.07
    },{
        'id': '2.26',
        'parent': '1.2',
        'name': '瑞典', 
        'value': 129.41
    },{
        'id': '2.27',
        'parent': '1.2',
        'name': '瑞士', 
        'value': 66.51
    },{
        'id': '2.28',
        'parent': '1.2',
        'name': '葡萄牙', 
        'value': 44.02
    },
    // 第三圈 美洲包含的国家
    {
        'id': '2.30',
        'parent': '1.3',
        'name': '美国', 
        'value':1825.38
    },{
        'id': '2.31',
        'parent': '1.3',
        'name': '加拿大', 
        'value': 599.84
    },{
        'id': '2.32',
        'parent': '1.3',
        'name': '拉丁美洲', 
        'value': 292.16
    },
    // 第三圈 大洋洲包含的国家
    {
        'id': '2.40',
        'parent': '1.4',
        'name': '大洋洲及太平洋岛屿', 
        'value': 720.01
    },{
        'id': '2.41',
        'parent': '1.4',
        'name': '澳大利亚', 
        'value': 600.21
    },{
        'id': '2.42',
        'parent': '1.4',
        'name': '新西兰', 
        'value': 108.83
    },
    // 第三圈 非洲包含的国家
    {
        'id': '2.50',
        'parent': '1.5',
        'name': '非洲', 
        'value': 457.61
    },

// -----------------------------------------------------

    // 第四圈 亚洲 韩国
    {
        'id': '3.10',
        'parent': '2.10',
        'name': '2016年', 
        'value': 477.5
    },{
        'id': '3.11',
        'parent': '2.10',
        'name': '2015年', 
        'value': 444.44
    },{
        'id': '3.12',
        'parent': '2.10',
        'name': '2014年', 
        'value': 418.2
    },{
        'id': '3.13',
        'parent': '2.10',
        'name': '2013年', 
        'value': 396.9
    },{
        'id': '3.14',
        'parent': '2.10',
        'name': '2012年', 
        'value': 406.99
    },{
        'id': '3.15',
        'parent': '2.10',
        'name': '2011年', 
        'value': 418.54
    },{
        'id': '3.16',
        'parent': '2.10',
        'name': '2010年', 
        'value': 407.64
    },{
        'id': '3.17',
        'parent': '2.10',
        'name': '2009年', 
        'value': 319.75
    },{
        'id': '3.18',
        'parent': '2.10',
        'name': '2008年', 
        'value': 396.04
    },
    // 第四圈 日本
    {
        'id': '3.20',
        'parent': '2.11',
        'name': '2016年', 
        'value': 259
    },{
        'id': '3.21',
        'parent': '2.11',
        'name': '2015年', 
        'value': 249.77
    },{
        'id': '3.22',
        'parent': '2.11',
        'name': '2014年', 
        'value': 271.8
    },{
        'id': '3.23',
        'parent': '2.11',
        'name': '2013年', 
        'value': 287.8
    },{
        'id': '3.24',
        'parent': '2.11',
        'name': '2012年', 
        'value': 351.82
    },{
        'id': '3.25',
        'parent': '2.11',
        'name': '2011年', 
        'value': 365.82
    },{
        'id': '3.26',
        'parent': '2.11',
        'name': '2010年', 
        'value': 373.12
    },{
        'id': '3.27',
        'parent': '2.11',
        'name': '2009年', 
        'value': 331.75
    },{
        'id': '3.28',
        'parent': '2.11',
        'name': '2008年', 
        'value': 344.61
    },
    // 第四圈 马来西亚
    {
        'id': '3.30',
        'parent': '2.12',
        'name': '2016年', 
        'value': 116.5
    },{
        'id': '3.31',
        'parent': '2.12',
        'name': '2015年', 
        'value': 107.55 
    },{
        'id': '3.32',
        'parent': '2.12',
        'name': '2014年', 
        'value':  113  
    },{
        'id': '3.33',
        'parent': '2.12',
        'name': '2013年', 
        'value':  120.7   
    },{
        'id': '3.34',
        'parent': '2.12',
        'name': '2012年', 
        'value': 123.55
    },{
        'id': '3.35',
        'parent': '2.12',
        'name': '2011年', 
        'value': 124.51
    },{
        'id': '3.36',
        'parent': '2.12',
        'name': '2011年', 
        'value': 124.52
    },{
        'id': '3.37',
        'parent': '2.12',
        'name': '2009年', 
        'value': 105.9
    },{
        'id': '3.38',
        'parent': '2.12',
        'name': '2008年', 
        'value': 104.05
    },

    // 第四圈 蒙古
     {
        'id': '3.40',
        'parent': '2.13',
        'name': '2016年', 
        'value': 158.1
    },{
        'id': '3.41',
        'parent': '2.13',
        'name': '2015年', 
        'value': 101.41
    },{
        'id': '3.42',
        'parent': '2.13',
        'name': '2014年', 
        'value':108.3     
    },{
        'id': '3.43',
        'parent': '2.13',
        'name': '2013年', 
        'value': 105    
    },{
        'id': '3.44',
        'parent': '2.13',
        'name': '2012年', 
        'value':101.05 
    },{
        'id': '3.45',
        'parent': '2.13',
        'name': '2011年', 
        'value':99.42 
    },{
        'id': '3.46',
        'parent': '2.13',
        'name': '2010年', 
        'value': 79.44
    },{
        'id': '3.47',
        'parent': '2.13',
        'name': '2009年', 
        'value':57.67 
    },{
        'id': '3.48',
        'parent': '2.13',
        'name': '2008年', 
        'value': 70.53
    },

    // 第四圈 新加坡
     {
        'id': '3.50',
        'parent': '2.14',
        'name': '2016年', 
        'value': 92.5
    }, {
        'id': '3.51',
        'parent': '2.14',
        'name': '2015年', 
        'value': 90.53
    },{
        'id': '3.52',
        'parent': '2.14',
        'name': '2014年', 
        'value':97.1     
    },{
        'id': '3.53',
        'parent': '2.14',
        'name': '2013年', 
        'value': 96.7    
    },{
        'id': '3.54',
        'parent': '2.14',
        'name': '2012年', 
        'value': 102.77
    },{
        'id': '3.55',
        'parent': '2.14',
        'name': '2011年', 
        'value': 106.3
    },{
        'id': '3.56',
        'parent': '2.14',
        'name': '2010年', 
        'value':100.37 
    },{
        'id': '3.57',
        'parent': '2.14',
        'name': '2009年', 
        'value': 88.95
    },{
        'id': '3.58',
        'parent': '2.14',
        'name': '2008年', 
        'value': 87.58
    },

    // 第四圈 菲律宾
     {
        'id': '3.60',
        'parent': '2.15',
        'name': '2016年', 
        'value': 113.5
    },{
        'id': '3.61',
        'parent': '2.15',
        'name': '2015年', 
        'value': 100.4
    },{
        'id': '3.62',
        'parent': '2.15',
        'name': '2014年', 
        'value': 96.8    
    },{
        'id': '3.63',
        'parent': '2.15',
        'name': '2013年', 
        'value': 99.7    
    },{
        'id': '3.64',
        'parent': '2.15',
        'name': '2012年', 
        'value': 96.2   
    },{
        'id': '3.65',
        'parent': '2.15',
        'name': '2011年', 
        'value': 89.43
    },{
        'id': '3.66',
        'parent': '2.15',
        'name': '2010年', 
        'value': 82.83
    },{
        'id': '3.67',
        'parent': '2.15',
        'name': '2009年', 
        'value':74.89 
    },{
        'id': '3.68',
        'parent': '2.15',
        'name': '2008年', 
        'value': 79.53
    },

    // 第四圈 泰国
     {
        'id': '3.70',
        'parent': '2.16',
        'name': '2016年', 
        'value': 75.3
    },{
        'id': '3.71',
        'parent': '2.16',
        'name': '2015年', 
        'value': 64.15
    },{
        'id': '3.72',
        'parent': '2.16',
        'name': '2014年', 
        'value': 61.3   
    },{
        'id': '3.73',
        'parent': '2.16',
        'name': '2013年', 
        'value':  65.2  
    },{
        'id': '3.74',
        'parent': '2.16',
        'name': '2012年', 
        'value':64.76
    },{
        'id': '3.75',
        'parent': '2.16',
        'name': '2011年', 
        'value': 60.8
    },{
        'id': '3.76',
        'parent': '2.16',
        'name': '2010年', 
        'value':63.55
    },{
        'id': '3.77',
        'parent': '2.16',
        'name': '2009年', 
        'value': 54.18
    },{
        'id': '3.78',
        'parent': '2.16',
        'name': '2008年', 
        'value': 55.43
    },

    // 第四圈 印度
     {
        'id': '3.80',
        'parent': '2.17',
        'name': '2016年', 
        'value': 80
    },{
        'id': '3.81',
        'parent': '2.17',
        'name': '2015年', 
        'value': 73.05
    },{
        'id': '3.82',
        'parent': '2.17',
        'name': '2014年', 
        'value':  71   
    },{
        'id': '3.83',
        'parent': '2.17',
        'name': '2013年', 
        'value':  67.7   
    },{
        'id': '3.84',
        'parent': '2.17',
        'name': '2012年', 
        'value': 61.02
    },{
        'id': '3.85',
        'parent': '2.17',
        'name': '2011年', 
        'value': 60.65
    },{
        'id': '3.86',
        'parent': '2.17',
        'name': '2010年', 
        'value': 54.93
    },{
        'id': '3.87',
        'parent': '2.17',
        'name': '2009年', 
        'value': 44.89
    },{
        'id': '3.88',
        'parent': '2.17',
        'name': '2008年', 
        'value': 43.66
    },

    // 第四圈 印度尼西亚
     {
        'id': '3.90',
        'parent': '2.18',
        'name': '2016年', 
        'value': 63.4
    },{
        'id': '3.91',
        'parent': '2.18',
        'name': '2015年', 
        'value':54.48 
    },{
        'id': '3.92',
        'parent': '2.18',
        'name': '2014年', 
        'value': 56.7    
    },{
        'id': '3.93',
        'parent': '2.18',
        'name': '2013年', 
        'value': 60.5    
    },{
        'id': '3.94',
        'parent': '2.18',
        'name': '2012年', 
        'value': 62.2
    },{
        'id': '3.95',
        'parent': '2.18',
        'name': '2011年', 
        'value':  60.87
    },{
        'id': '3.96',
        'parent': '2.18',
        'name': '2010年', 
        'value':57.34
    },{
        'id': '3.97',
        'parent': '2.18',
        'name': '2009年', 
        'value': 46.9 
    },{
        'id': '3.98',
        'parent': '2.18',
        'name': '2008年', 
        'value': 42.63
    },
    
    // 第四圈 朝鲜
    {
        'id': '3.99',
        'parent': '2.19',
        'name': '2016年', 
        'value': 21
    }, {
        'id': '3.991',
        'parent': '2.19',
        'name': '2015年', 
        'value': 18.83
    },{
        'id': '3.992',
        'parent': '2.19',
        'name': '2014年', 
        'value':18.4     
    },{
        'id': '3.993',
        'parent': '2.19',
        'name': '2013年', 
        'value':20.7     
    },{
        'id': '3.994',
        'parent': '2.19',
        'name': '2012年', 
        'value':18.06 
    },{
        'id': '3.995',
        'parent': '2.19',
        'name': '2011年', 
        'value': 15.23
    },{
        'id': '3.996',
        'parent': '2.19',
        'name': '2010年', 
        'value': 11.64
    },{
        'id': '3.997',
        'parent': '2.19',
        'name': '2009年', 
        'value':10.56 
    },{
        'id': '3.998',
        'parent': '2.19',
        'name': '2008年', 
        'value': 10.18
    },

// ---------------------------------------------------------

    // 第四圈  欧洲 俄罗斯
    {
        'id': '4.0',
        'parent': '2.20',
        'name': '2016年', 
        'value': 197.7 
    },
    // 第四圈 德国
    {
        'id': '4.1',
        'parent': '2.21',
        'name': '2016年', 
        'value': 62.5
    },
    // 第四圈 英国
    {
        'id': '4.2',
        'parent': '2.22',
        'name': '2016年', 
        'value': 59.5
    },
    // 第四圈 法国
    {
        'id': '4.3',
        'parent': '2.23',
        'name': '2016年', 
        'value': 50.4
    },
    // 第四圈 意大利
    {
        'id': '4.4',
        'parent': '2.24',
        'name': '2016年', 
        'value': 26.7
    },
    // 第四圈 荷兰
    {
        'id': '4.5',
        'parent': '2.25',
        'name': '2016年', 
        'value':20 
    },
    // 第四圈 瑞典
    {
        'id': '4.6',
        'parent': '2.26',
        'name': '2016年', 
        'value':11.5 
    },
    // 第四圈 瑞士
    {
        'id': '4.7',
        'parent': '2.27',
        'name': '2016年', 
        'value': 7.3
    },
    // 第四圈 葡萄牙
    {
        'id': '4.8',
        'parent': '2.28',
        'name': '2016年', 
        'value': 5.5
    },

// ---------------------------------------------------------

    // 第四圈 美洲 美国
    {
        'id': '5.0',
        'parent': '2.30',
        'name': '2016年', 
        'value': 225
    },
    // 第四圈 加拿大
    {
        'id': '5.1',
        'parent': '2.31',
        'name': '2016年', 
        'value':74.1 
    },
    // 第四圈 拉丁美洲
    {
        'id': '5.2',
        'parent': '2.32',
        'name': '2016年', 
        'value': 39
    },

// ----------------------------------------------------------

    // 第四圈 大洋洲 大洋洲及太平洋岛屿
    {
        'id': '6.0',
        'parent': '2.40',
        'name': '2016年', 
        'value': 82.6
    },
    // 第四圈 澳大利亚
    {
        'id': '6.1',
        'parent': '2.41',
        'name': '2016年', 
        'value':67.5
    },
    // 第四圈 新西兰
    {
        'id': '6.2',
        'parent': '2.42',
        'name': '2016年', 
        'value': 13.6
    },



];
